## Plan Result (1112: sbox_aria - Terraform Plan Apply)




<pre><code>Plan: 3 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;01&#34;]
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp[&#34;01&#34;]
  * azurerm_private_endpoint.functionapp[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp00[&#34;00&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_dns_zone_virtual_network_link.webapps["01"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
        id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/vnet-link-01-webapps"
        name                  = "vnet-link-01-webapps"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_private_dns_zone_virtual_network_link.webapps["02"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "webapps" {
        id                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/vnet-link-02-webapps"
        name                  = "vnet-link-02-webapps"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_private_endpoint.functionapp["01"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "functionapp" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Network/privateEndpoints/pe-01-functionapp"
        name                          = "pe-01-functionapp"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_private_endpoint.functionapp["02"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "functionapp" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Network/privateEndpoints/pe-02-functionapp"
        name                          = "pe-02-functionapp"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_private_endpoint.functionapp00["00"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "functionapp00" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/pe-00-functionapp"
        name                          = "pe-00-functionapp"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "sandbox" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 5 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 1112: sbox_aria - Terraform Plan Apply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-aria/issues/119/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":119,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->